// Автоматически сгенерированные привязки
export const TEACHER_ASSIGNMENTS = [
  {
    "name": "Нажмадинов Марат",
    "weekly_hours": 19,
    "subjects": {
      "алгебра": {
        "8Д": 3,
        "11B": 4
      },
      "геометрия": {
        "8Д": 1,
        "11B": 2
      },
      "ҰБТ": {
        "11B": 3
      },
      "мат.сау": {
        "11B": 2
      },
      "қосымша": {
        "8Д": 1,
        "11B": 3
      }
    }
  },
  {
    "name": "Есалина Айзада",
    "weekly_hours": 19,
    "subjects": {
      "алгебра": {
        "8C": 3,
        "11A": 4
      },
      "геометрия": {
        "8C": 1,
        "11A": 2
      },
      "ҰБТ": {
        "11A": 3
      },
      "мат.сау": {
        "11A": 2
      },
      "қосымша": {
        "8C": 1,
        "11A": 3
      }
    }
  },
  {
    "name": "Даулетбаева Сая",
    "weekly_hours": 20,
    "subjects": {
      "алгебра": {
        "10A": 4,
        "10B": 4
      },
      "геометрия": {
        "10A": 2,
        "10B": 2
      },
      "ҰБТ": {
        "10A": 4
      },
      "мат.сау": {
        "10A": 2,
        "10B": 2
      }
    }
  },
  {
    "name": "Жоламан Мейрамбек",
    "weekly_hours": 21,
    "subjects": {
      "алгебра": {
        "8A": 3,
        "9A": 3,
        "9B": 3
      },
      "геометрия": {
        "8A": 1,
        "9A": 1,
        "9B": 1
      },
      "ҰБТ": {
        "10A": 4
      },
      "қосымша": {
        "8A": 1,
        "9A": 1,
        "9B": 1
      },
      "қарж сауат": {
        "10A": 1,
        "10B": 1
      }
    }
  },
  {
    "name": "Арыстанғалиқызы Ақмарал",
    "weekly_hours": 21,
    "subjects": {
      "алгебра": {
        "7A": 3,
        "7C": 3,
        "8B": 3
      },
      "геометрия": {
        "7A": 1,
        "7C": 1,
        "8B": 1
      },
      "қосымша": {
        "7A": 2,
        "7C": 2,
        "8B": 1,
        "10A": 2,
        "10B": 2
      }
    }
  },
  {
    "name": "Сулейманов Бегдулла",
    "weekly_hours": 24,
    "subjects": {
      "физика": {
        "8C": 2,
        "8Д": 2,
        "9B": 2,
        "10A": 1,
        "10B": 1,
        "11A": 2,
        "11B": 2
      },
      "ҰБТ": {
        "10A": 5,
        "11A": 2,
        "11B": 2
      },
      "қосымша": {
        "8C": 1,
        "8Д": 1,
        "9B": 1
      }
    }
  },
  {
    "name": "Сунгариева Айгерим Бисенбаевна",
    "weekly_hours": 18,
    "subjects": {
      "физика": {
        "7A": 2,
        "7B": 2,
        "7C": 2,
        "8A": 2,
        "8B": 2,
        "9A": 2
      },
      "қосымша": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8A": 1,
        "8B": 1,
        "9A": 1
      }
    }
  },
  {
    "name": "Ахметова Индира",
    "weekly_hours": 25,
    "subjects": {
      "информатика": {
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1,
        "9A": 1,
        "9B": 1,
        "10A": 2,
        "11A": 2,
        "11B": 2
      },
      "ҰБТ": {
        "10A": 3,
        "11A": 2,
        "11B": 2
      },
      "программалау": {
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1,
        "9A": 1,
        "9B": 1
      }
    }
  },
  {
    "name": "Сапар Елжан Шакизадаұлы",
    "weekly_hours": 3,
    "subjects": {
      "информатика": {
        "7A": 1,
        "7B": 1,
        "7C": 1
      }
    }
  },
  {
    "name": "Балтабай Жанболат Бекболатұлы",
    "weekly_hours": 22,
    "subjects": {
      "қазақстан тарихы": {
        "11A": 2,
        "11B": 2
      },
      "дүниежүзі тарихы": {
        "10A": 2,
        "10B": 2,
        "11A": 2,
        "11B": 2
      },
      "ҰБТ Қ.тарих": {
        "11A": 2,
        "11B": 2
      },
      "ҰБТ ДЖ.тарих": {
        "10A": 1,
        "10B": 1,
        "11A": 2,
        "11B": 2
      }
    }
  },
  {
    "name": "Қангерей Қанат",
    "weekly_hours": 23,
    "subjects": {
      "қазақстан тарихы": {
        "7A": 2,
        "7B": 2,
        "7C": 2,
        "9A": 2,
        "9B": 2
      },
      "дүниежүзі тарихы": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "9A": 1,
        "9B": 1
      },
      "құқық негіздері": {
        "9A": 1,
        "9B": 1,
        "10A": 3,
        "11A": 3
      }
    }
  },
  {
    "name": "Ақырап Ақерке",
    "weekly_hours": 21,
    "subjects": {
      "IELTS": {
        "8C": 3,
        "9A": 3,
        "9B": 3,
        "11A": 4,
        "11B": 4
      },
      "қосымша": {
        "8C": 1
      },
      "ағылшын тілі/ҰБТ": {
        "11B": 3
      }
    }
  },
  {
    "name": "Таңатар Мадина",
    "weekly_hours": 19,
    "subjects": {
      "IELTS": {
        "8A": 3,
        "8B": 3,
        "10A": 4,
        "10B": 4
      },
      "қосымша": {
        "8A": 1,
        "8B": 1
      },
      "ағылшын тілі/ҰБТ": {
        "10A": 3
      }
    }
  },
  {
    "name": "Қайыржанова Аружан",
    "weekly_hours": 19,
    "subjects": {
      "ағылшын тілі": {
        "7A": 3,
        "7B": 3,
        "7C": 3,
        "8Д": 3
      },
      "қосымша": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8Д": 1
      },
      "китайский": {
        "7A": 1,
        "7B": 1,
        "7C": 1
      }
    }
  },
  {
    "name": "Халелова Анель(куратор)",
    "weekly_hours": 13,
    "subjects": {
      "Ж.құзырет": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1,
        "9A": 1,
        "9B": 1,
        "10A": 1,
        "10B": 1,
        "11A": 1,
        "11B": 1
      }
    }
  },
  {
    "name": "Бактыгулов Аманжол",
    "weekly_hours": 20,
    "subjects": {
      "қазақ тілі": {
        "8Д": 2,
        "10A": 1,
        "10B": 1,
        "11A": 1
      },
      "қазақ әдебиеті": {
        "8A": 2,
        "8Д": 2,
        "10A": 2,
        "10B": 2,
        "11A": 2
      },
      "Абайтану": {
        "8A": 1,
        "8Д": 1,
        "10A": 1,
        "10B": 1,
        "11A": 1
      }
    }
  },
  {
    "name": "Утенова Куралай",
    "weekly_hours": 18,
    "subjects": {
      "қазақ тілі": {
        "7A": 2,
        "7B": 2,
        "7C": 2,
        "11B": 1
      },
      "қазақ әдебиеті": {
        "7A": 2,
        "7B": 2,
        "7C": 2,
        "11B": 2
      },
      "Абайтану/": {
        "8B": 1,
        "8C": 1,
        "11B": 1
      }
    }
  },
  {
    "name": "Жомартова Айым Кайратқызы(куратор)",
    "weekly_hours": 18,
    "subjects": {
      "қазақ тілі": {
        "8A": 2,
        "8B": 2,
        "8C": 2,
        "9A": 2,
        "9B": 2
      },
      "қазақ әдебиеті": {
        "8B": 2,
        "8C": 2,
        "9A": 2,
        "9B": 2
      }
    }
  },
  {
    "name": "Матигулова Гульсара Бактыбергеновна",
    "weekly_hours": 20,
    "subjects": {
      "орыс тілі мен әдебиеті": {
        "8C": 3,
        "8Д": 3,
        "9A": 3,
        "9B": 3,
        "10A": 2,
        "10B": 2,
        "11A": 2,
        "11B": 2
      }
    }
  },
  {
    "name": "Гореева Альфия Махмудовна(AIS)(до обеда)",
    "weekly_hours": 15,
    "subjects": {
      "орыс тілі мен әдебиеті": {
        "7A": 3,
        "7B": 3,
        "7C": 3,
        "8A": 3,
        "8B": 3
      }
    }
  },
  {
    "name": "Жадырасын Ернұр",
    "weekly_hours": 22,
    "subjects": {
      "география": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "9A": 1,
        "9B": 1,
        "10A": 2,
        "11A": 2,
        "11B": 2
      },
      "қосымша/ҰБТ": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "9A": 1,
        "9B": 1,
        "10A": 2,
        "11A": 2,
        "11B": 2
      }
    }
  },
  {
    "name": "Караева Аружан",
    "weekly_hours": 18,
    "subjects": {
      "биология": {
        "8A": 2,
        "8B": 2,
        "9A": 2,
        "9B": 2,
        "11A": 2,
        "11B": 2
      },
      "қосымша": {
        "8A": 1,
        "8B": 1,
        "11A": 2,
        "11B": 2
      }
    }
  },
  {
    "name": "Қайырқұлов Нұрсұлтан Амангелдіұлы",
    "weekly_hours": 17,
    "subjects": {
      "биология": {
        "7A": 2,
        "7B": 2,
        "8C": 2,
        "8Д": 2,
        "10A": 2
      },
      "қосымша": {
        "7A": 1,
        "7B": 1,
        "8C": 1,
        "8Д": 1,
        "10A": 3
      }
    }
  },
  {
    "name": "Шарафадинова Айжан Мырзабекқызы",
    "weekly_hours": 3,
    "subjects": {
      "биология": {
        "7C": 2
      },
      "қосымша": {
        "7C": 1
      }
    }
  },
  {
    "name": "Аділов Тлепберген Бекболұлы",
    "weekly_hours": 21,
    "subjects": {
      "дене тәрбиесі": {
        "8A": 2,
        "8C": 2,
        "8Д": 2,
        "9A": 2,
        "9B": 2,
        "10A": 2,
        "10B": 2,
        "11A": 1,
        "11B": 1
      },
      "дене шынықтыру: спорттық ойындар": {
        "8A": 1,
        "8C": 1,
        "8Д": 1,
        "9A": 1,
        "9B": 1
      }
    }
  },
  {
    "name": "Қарабай Айбат Нұрлыбайұлы",
    "weekly_hours": 12,
    "subjects": {
      "дене тәрбиесі": {
        "7A": 2,
        "7B": 2,
        "7C": 2,
        "8B": 2
      },
      "дене шынықтыру: спорттық ойындар": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8B": 1
      }
    }
  },
  {
    "name": "Назаров Дастан",
    "weekly_hours": 20,
    "subjects": {
      "химия": {
        "9A": 2,
        "9B": 2,
        "10A": 2,
        "10B": 2,
        "11A": 2,
        "11B": 2
      },
      "ҰБТ": {
        "10A": 1,
        "10B": 1,
        "11A": 2,
        "11B": 2
      },
      "қосымша": {
        "9A": 1,
        "9B": 1
      }
    }
  },
  {
    "name": "Аманғазы Сәнім",
    "weekly_hours": 21,
    "subjects": {
      "химия": {
        "7A": 2,
        "7B": 2,
        "7C": 2,
        "8A": 2,
        "8B": 2,
        "8C": 2,
        "8Д": 2
      },
      "қосымша": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1
      }
    }
  },
  {
    "name": "Қойшан Ырысжан Асқарбекқызы",
    "weekly_hours": 9,
    "subjects": {
      "көркем еңбек": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1,
        "9A": 1,
        "9B": 1
      }
    }
  },
  {
    "name": "Қазиев Нұртлеу",
    "weekly_hours": 9,
    "subjects": {
      "көркем еңбек": {
        "7A": 1,
        "7B": 1,
        "7C": 1,
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1,
        "9A": 1,
        "9B": 1
      }
    }
  },
  {
    "name": "Сарқытбаев Н.",
    "weekly_hours": 4,
    "subjects": {
      "АӘД": {
        "10A": 1,
        "10B": 1,
        "11A": 1,
        "11B": 1
      }
    }
  },
  {
    "name": "Иван Оралсын",
    "weekly_hours": 18,
    "subjects": {
      "қазақстан тарихы": {
        "8A": 2,
        "8B": 2,
        "8C": 2,
        "8Д": 2,
        "10A": 2,
        "10B": 2
      },
      "дүниежүзі тарихы": {
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1
      },
      "құқық негіздері": {
        "10A": 1,
        "10B": 1
      }
    }
  },
  {
    "name": "Ерлан Қуанович",
    "weekly_hours": 10,
    "subjects": {
      "география": {
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1,
        "10A": 1,
        "10B": 1
      },
      "қосымша/ҰБТ": {
        "8A": 1,
        "8B": 1,
        "8C": 1,
        "8Д": 1
      }
    }
  },
  {
    "name": "Байдирахманова Б.С",
    "weekly_hours": 6,
    "subjects": {
      "алгебра": {
        "7C": 3
      },
      "геометрия": {
        "7C": 1
      },
      "қосымша": {
        "7C": 2
      }
    }
  },
  {
    "name": "Жаулбаев А.З.",
    "weekly_hours": 3,
    "subjects": {
      "профориентация": {
        "11A": 1,
        "11B": 2
      }
    }
  },
  {
    "name": "Душманова А.Қ.",
    "weekly_hours": 4,
    "subjects": {
      "психология": {
        "10A": 1,
        "10B": 1,
        "11A": 1,
        "11B": 1
      }
    }
  }
];